{"config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 600, 600, 3], "name": "input_1", "dtype": "float32", "sparse": false}}, {"name": "block1_conv1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"padding": "same", "data_format": "channels_last", "filters": 64, "kernel_size": [3, 3], "kernel_constraint": null, "name": "block1_conv1", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "dtype": "float32", "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "dilation_rate": [1, 1]}}, {"name": "block1_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "config": {"padding": "same", "data_format": "channels_last", "filters": 64, "kernel_size": [3, 3], "kernel_constraint": null, "name": "block1_conv2", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "dtype": "float32", "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "dilation_rate": [1, 1]}}, {"name": "block1_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "dtype": "float32", "pool_size": [2, 2], "trainable": false, "name": "block1_pool"}}, {"name": "block2_conv1", "class_name": "Conv2D", "inbound_nodes": [[["block1_pool", 0, 0, {}]]], "config": {"padding": "same", "data_format": "channels_last", "filters": 128, "kernel_size": [3, 3], "kernel_constraint": null, "name": "block2_conv1", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "dtype": "float32", "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "dilation_rate": [1, 1]}}, {"name": "block2_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "config": {"padding": "same", "data_format": "channels_last", "filters": 128, "kernel_size": [3, 3], "kernel_constraint": null, "name": "block2_conv2", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "dtype": "float32", "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "dilation_rate": [1, 1]}}, {"name": "block2_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "dtype": "float32", "pool_size": [2, 2], "trainable": false, "name": "block2_pool"}}, {"name": "block3_conv1", "class_name": "Conv2D", "inbound_nodes": [[["block2_pool", 0, 0, {}]]], "config": {"padding": "same", "data_format": "channels_last", "filters": 256, "kernel_size": [3, 3], "kernel_constraint": null, "name": "block3_conv1", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "dtype": "float32", "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "dilation_rate": [1, 1]}}, {"name": "block3_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "config": {"padding": "same", "data_format": "channels_last", "filters": 256, "kernel_size": [3, 3], "kernel_constraint": null, "name": "block3_conv2", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "dtype": "float32", "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "dilation_rate": [1, 1]}}, {"name": "block3_conv3", "class_name": "Conv2D", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "config": {"padding": "same", "data_format": "channels_last", "filters": 256, "kernel_size": [3, 3], "kernel_constraint": null, "name": "block3_conv3", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "dtype": "float32", "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "dilation_rate": [1, 1]}}, {"name": "block3_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "dtype": "float32", "pool_size": [2, 2], "trainable": false, "name": "block3_pool"}}, {"name": "block4_conv1", "class_name": "Conv2D", "inbound_nodes": [[["block3_pool", 0, 0, {}]]], "config": {"padding": "same", "data_format": "channels_last", "filters": 512, "kernel_size": [3, 3], "kernel_constraint": null, "name": "block4_conv1", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "dtype": "float32", "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "dilation_rate": [1, 1]}}, {"name": "block4_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "config": {"padding": "same", "data_format": "channels_last", "filters": 512, "kernel_size": [3, 3], "kernel_constraint": null, "name": "block4_conv2", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "dtype": "float32", "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "dilation_rate": [1, 1]}}, {"name": "block4_conv3", "class_name": "Conv2D", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "config": {"padding": "same", "data_format": "channels_last", "filters": 512, "kernel_size": [3, 3], "kernel_constraint": null, "name": "block4_conv3", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "dtype": "float32", "trainable": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "dilation_rate": [1, 1]}}, {"name": "block4_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "dtype": "float32", "pool_size": [2, 2], "trainable": false, "name": "block4_pool"}}, {"name": "block5_conv1", "class_name": "Conv2D", "inbound_nodes": [[["block4_pool", 0, 0, {}]]], "config": {"padding": "same", "data_format": "channels_last", "filters": 512, "kernel_size": [3, 3], "kernel_constraint": null, "name": "block5_conv1", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "dtype": "float32", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "dilation_rate": [1, 1]}}, {"name": "block5_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "config": {"padding": "same", "data_format": "channels_last", "filters": 512, "kernel_size": [3, 3], "kernel_constraint": null, "name": "block5_conv2", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "dtype": "float32", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "dilation_rate": [1, 1]}}, {"name": "block5_conv3", "class_name": "Conv2D", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "config": {"padding": "same", "data_format": "channels_last", "filters": 512, "kernel_size": [3, 3], "kernel_constraint": null, "name": "block5_conv3", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "dtype": "float32", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null, "dilation_rate": [1, 1]}}, {"name": "block5_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "dtype": "float32", "pool_size": [2, 2], "trainable": true, "name": "block5_pool"}}, {"name": "global_max_pooling2d_1", "class_name": "GlobalMaxPooling2D", "inbound_nodes": [[["block5_pool", 0, 0, {}]]], "config": {"name": "global_max_pooling2d_1", "dtype": "float32", "data_format": "channels_last", "trainable": true}}, {"name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["global_max_pooling2d_1", 0, 0, {}]]], "config": {"units": 256, "dtype": "float32", "kernel_constraint": null, "name": "dense_1", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "activity_regularizer": null}}, {"name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"dtype": "float32", "seed": null, "rate": 0.5, "trainable": true, "name": "dropout_1", "noise_shape": null}}, {"name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"units": 4, "dtype": "float32", "kernel_constraint": null, "name": "dense_2", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "sigmoid", "activity_regularizer": null}}], "output_layers": [["dense_2", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow", "class_name": "Model"}