{"keras_version": "2.3.1", "config": {"name": "model_3", "layers": [{"inbound_nodes": [], "name": "input_3", "class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 500, 500, 3], "sparse": false, "name": "input_3"}}, {"inbound_nodes": [[["input_3", 0, 0, {}]]], "name": "block1_conv1", "class_name": "Conv2D", "config": {"name": "block1_conv1", "strides": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "trainable": false, "data_format": "channels_last", "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activation": "relu", "kernel_size": [3, 3], "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "filters": 64, "bias_regularizer": null, "bias_constraint": null}}, {"inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "name": "block1_conv2", "class_name": "Conv2D", "config": {"name": "block1_conv2", "strides": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "trainable": false, "data_format": "channels_last", "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activation": "relu", "kernel_size": [3, 3], "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "filters": 64, "bias_regularizer": null, "bias_constraint": null}}, {"inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "name": "block1_pool", "class_name": "MaxPooling2D", "config": {"name": "block1_pool", "strides": [2, 2], "dtype": "float32", "trainable": false, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid"}}, {"inbound_nodes": [[["block1_pool", 0, 0, {}]]], "name": "block2_conv1", "class_name": "Conv2D", "config": {"name": "block2_conv1", "strides": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "trainable": false, "data_format": "channels_last", "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activation": "relu", "kernel_size": [3, 3], "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "filters": 128, "bias_regularizer": null, "bias_constraint": null}}, {"inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "name": "block2_conv2", "class_name": "Conv2D", "config": {"name": "block2_conv2", "strides": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "trainable": false, "data_format": "channels_last", "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activation": "relu", "kernel_size": [3, 3], "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "filters": 128, "bias_regularizer": null, "bias_constraint": null}}, {"inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "name": "block2_pool", "class_name": "MaxPooling2D", "config": {"name": "block2_pool", "strides": [2, 2], "dtype": "float32", "trainable": false, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid"}}, {"inbound_nodes": [[["block2_pool", 0, 0, {}]]], "name": "block3_conv1", "class_name": "Conv2D", "config": {"name": "block3_conv1", "strides": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "trainable": false, "data_format": "channels_last", "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activation": "relu", "kernel_size": [3, 3], "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "filters": 256, "bias_regularizer": null, "bias_constraint": null}}, {"inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "name": "block3_conv2", "class_name": "Conv2D", "config": {"name": "block3_conv2", "strides": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "trainable": false, "data_format": "channels_last", "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activation": "relu", "kernel_size": [3, 3], "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "filters": 256, "bias_regularizer": null, "bias_constraint": null}}, {"inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "name": "block3_conv3", "class_name": "Conv2D", "config": {"name": "block3_conv3", "strides": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "trainable": false, "data_format": "channels_last", "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activation": "relu", "kernel_size": [3, 3], "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "filters": 256, "bias_regularizer": null, "bias_constraint": null}}, {"inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "name": "block3_conv4", "class_name": "Conv2D", "config": {"name": "block3_conv4", "strides": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "trainable": false, "data_format": "channels_last", "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activation": "relu", "kernel_size": [3, 3], "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "filters": 256, "bias_regularizer": null, "bias_constraint": null}}, {"inbound_nodes": [[["block3_conv4", 0, 0, {}]]], "name": "block3_pool", "class_name": "MaxPooling2D", "config": {"name": "block3_pool", "strides": [2, 2], "dtype": "float32", "trainable": false, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid"}}, {"inbound_nodes": [[["block3_pool", 0, 0, {}]]], "name": "block4_conv1", "class_name": "Conv2D", "config": {"name": "block4_conv1", "strides": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "trainable": false, "data_format": "channels_last", "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activation": "relu", "kernel_size": [3, 3], "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "filters": 512, "bias_regularizer": null, "bias_constraint": null}}, {"inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "name": "block4_conv2", "class_name": "Conv2D", "config": {"name": "block4_conv2", "strides": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "trainable": false, "data_format": "channels_last", "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activation": "relu", "kernel_size": [3, 3], "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "filters": 512, "bias_regularizer": null, "bias_constraint": null}}, {"inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "name": "block4_conv3", "class_name": "Conv2D", "config": {"name": "block4_conv3", "strides": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "trainable": false, "data_format": "channels_last", "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activation": "relu", "kernel_size": [3, 3], "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "filters": 512, "bias_regularizer": null, "bias_constraint": null}}, {"inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "name": "block4_conv4", "class_name": "Conv2D", "config": {"name": "block4_conv4", "strides": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activation": "relu", "kernel_size": [3, 3], "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "filters": 512, "bias_regularizer": null, "bias_constraint": null}}, {"inbound_nodes": [[["block4_conv4", 0, 0, {}]]], "name": "block4_pool", "class_name": "MaxPooling2D", "config": {"name": "block4_pool", "strides": [2, 2], "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid"}}, {"inbound_nodes": [[["block4_pool", 0, 0, {}]]], "name": "block5_conv1", "class_name": "Conv2D", "config": {"name": "block5_conv1", "strides": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activation": "relu", "kernel_size": [3, 3], "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "filters": 512, "bias_regularizer": null, "bias_constraint": null}}, {"inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "name": "block5_conv2", "class_name": "Conv2D", "config": {"name": "block5_conv2", "strides": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activation": "relu", "kernel_size": [3, 3], "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "filters": 512, "bias_regularizer": null, "bias_constraint": null}}, {"inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "name": "block5_conv3", "class_name": "Conv2D", "config": {"name": "block5_conv3", "strides": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activation": "relu", "kernel_size": [3, 3], "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "filters": 512, "bias_regularizer": null, "bias_constraint": null}}, {"inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "name": "block5_conv4", "class_name": "Conv2D", "config": {"name": "block5_conv4", "strides": [1, 1], "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "data_format": "channels_last", "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "activation": "relu", "kernel_size": [3, 3], "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "filters": 512, "bias_regularizer": null, "bias_constraint": null}}, {"inbound_nodes": [[["block5_conv4", 0, 0, {}]]], "name": "block5_pool", "class_name": "MaxPooling2D", "config": {"name": "block5_pool", "strides": [2, 2], "dtype": "float32", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid"}}, {"inbound_nodes": [[["block5_pool", 0, 0, {}]]], "name": "global_max_pooling2d_3", "class_name": "GlobalMaxPooling2D", "config": {"data_format": "channels_last", "name": "global_max_pooling2d_3", "dtype": "float32", "trainable": true}}, {"inbound_nodes": [[["global_max_pooling2d_3", 0, 0, {}]]], "name": "dense_5", "class_name": "Dense", "config": {"name": "dense_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null}}, {"inbound_nodes": [[["dense_5", 0, 0, {}]]], "name": "dropout_3", "class_name": "Dropout", "config": {"noise_shape": null, "name": "dropout_3", "seed": null, "trainable": true, "rate": 0.5, "dtype": "float32"}}, {"inbound_nodes": [[["dropout_3", 0, 0, {}]]], "name": "dense_6", "class_name": "Dense", "config": {"name": "dense_6", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "dtype": "float32", "units": 4, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null}}], "input_layers": [["input_3", 0, 0]], "output_layers": [["dense_6", 0, 0]]}, "class_name": "Model", "backend": "tensorflow"}