{"backend": "tensorflow", "keras_version": "2.3.1", "class_name": "Model", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 600, 600, 3], "name": "input_1", "dtype": "float32", "sparse": false}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "block1_conv1", "class_name": "Conv2D", "config": {"padding": "same", "filters": 64, "dilation_rate": [1, 1], "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "name": "block1_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "name": "block1_conv2", "class_name": "Conv2D", "config": {"padding": "same", "filters": 64, "dilation_rate": [1, 1], "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "name": "block1_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "name": "block1_pool", "class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "trainable": false, "strides": [2, 2], "dtype": "float32", "pool_size": [2, 2], "name": "block1_pool"}}, {"inbound_nodes": [[["block1_pool", 0, 0, {}]]], "name": "block2_conv1", "class_name": "Conv2D", "config": {"padding": "same", "filters": 128, "dilation_rate": [1, 1], "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "name": "block2_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "name": "block2_conv2", "class_name": "Conv2D", "config": {"padding": "same", "filters": 128, "dilation_rate": [1, 1], "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "name": "block2_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "name": "block2_pool", "class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "trainable": false, "strides": [2, 2], "dtype": "float32", "pool_size": [2, 2], "name": "block2_pool"}}, {"inbound_nodes": [[["block2_pool", 0, 0, {}]]], "name": "block3_conv1", "class_name": "Conv2D", "config": {"padding": "same", "filters": 256, "dilation_rate": [1, 1], "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "name": "block3_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "name": "block3_conv2", "class_name": "Conv2D", "config": {"padding": "same", "filters": 256, "dilation_rate": [1, 1], "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "name": "block3_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "name": "block3_conv3", "class_name": "Conv2D", "config": {"padding": "same", "filters": 256, "dilation_rate": [1, 1], "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "name": "block3_conv3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "name": "block3_conv4", "class_name": "Conv2D", "config": {"padding": "same", "filters": 256, "dilation_rate": [1, 1], "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "name": "block3_conv4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["block3_conv4", 0, 0, {}]]], "name": "block3_pool", "class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "trainable": false, "strides": [2, 2], "dtype": "float32", "pool_size": [2, 2], "name": "block3_pool"}}, {"inbound_nodes": [[["block3_pool", 0, 0, {}]]], "name": "block4_conv1", "class_name": "Conv2D", "config": {"padding": "same", "filters": 512, "dilation_rate": [1, 1], "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "name": "block4_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "name": "block4_conv2", "class_name": "Conv2D", "config": {"padding": "same", "filters": 512, "dilation_rate": [1, 1], "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "name": "block4_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "name": "block4_conv3", "class_name": "Conv2D", "config": {"padding": "same", "filters": 512, "dilation_rate": [1, 1], "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "name": "block4_conv3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "name": "block4_conv4", "class_name": "Conv2D", "config": {"padding": "same", "filters": 512, "dilation_rate": [1, 1], "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "name": "block4_conv4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["block4_conv4", 0, 0, {}]]], "name": "block4_pool", "class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "dtype": "float32", "pool_size": [2, 2], "name": "block4_pool"}}, {"inbound_nodes": [[["block4_pool", 0, 0, {}]]], "name": "block5_conv1", "class_name": "Conv2D", "config": {"padding": "same", "filters": 512, "dilation_rate": [1, 1], "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "name": "block5_conv1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "name": "block5_conv2", "class_name": "Conv2D", "config": {"padding": "same", "filters": 512, "dilation_rate": [1, 1], "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "name": "block5_conv2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "name": "block5_conv3", "class_name": "Conv2D", "config": {"padding": "same", "filters": 512, "dilation_rate": [1, 1], "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "name": "block5_conv3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "name": "block5_conv4", "class_name": "Conv2D", "config": {"padding": "same", "filters": 512, "dilation_rate": [1, 1], "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_last", "name": "block5_conv4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null}}, {"inbound_nodes": [[["block5_conv4", 0, 0, {}]]], "name": "block5_pool", "class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "dtype": "float32", "pool_size": [2, 2], "name": "block5_pool"}}, {"inbound_nodes": [[["block5_pool", 0, 0, {}]]], "name": "global_max_pooling2d_1", "class_name": "GlobalMaxPooling2D", "config": {"name": "global_max_pooling2d_1", "data_format": "channels_last", "trainable": true, "dtype": "float32"}}, {"inbound_nodes": [[["global_max_pooling2d_1", 0, 0, {}]]], "name": "dense_1", "class_name": "Dense", "config": {"trainable": true, "dtype": "float32", "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "units": 256, "bias_regularizer": null, "use_bias": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dropout_1", "class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "trainable": true, "dtype": "float32", "name": "dropout_1", "rate": 0.5}}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "dense_2", "class_name": "Dense", "config": {"trainable": true, "dtype": "float32", "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "units": 4, "bias_regularizer": null, "use_bias": true, "activation": "sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}], "output_layers": [["dense_2", 0, 0]]}}