{"class_name": "Model", "keras_version": "2.3.1", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"dtype": "float32", "sparse": false, "name": "input_1", "batch_input_shape": [null, 600, 600, 3]}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "block1_conv1", "config": {"bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "name": "block1_conv1", "trainable": false, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dtype": "float32", "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 64, "data_format": "channels_last", "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "name": "block1_conv2", "config": {"bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "name": "block1_conv2", "trainable": false, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dtype": "float32", "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 64, "data_format": "channels_last", "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "name": "block1_pool", "config": {"name": "block1_pool", "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "trainable": false, "strides": [2, 2], "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["block1_pool", 0, 0, {}]]], "name": "block2_conv1", "config": {"bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "name": "block2_conv1", "trainable": false, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dtype": "float32", "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 128, "data_format": "channels_last", "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "name": "block2_conv2", "config": {"bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "name": "block2_conv2", "trainable": false, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dtype": "float32", "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 128, "data_format": "channels_last", "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "name": "block2_pool", "config": {"name": "block2_pool", "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "trainable": false, "strides": [2, 2], "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["block2_pool", 0, 0, {}]]], "name": "block3_conv1", "config": {"bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "name": "block3_conv1", "trainable": false, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dtype": "float32", "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 256, "data_format": "channels_last", "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "name": "block3_conv2", "config": {"bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "name": "block3_conv2", "trainable": false, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dtype": "float32", "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 256, "data_format": "channels_last", "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "name": "block3_conv3", "config": {"bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "name": "block3_conv3", "trainable": false, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dtype": "float32", "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 256, "data_format": "channels_last", "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "name": "block3_conv4", "config": {"bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "name": "block3_conv4", "trainable": false, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dtype": "float32", "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 256, "data_format": "channels_last", "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv4", 0, 0, {}]]], "name": "block3_pool", "config": {"name": "block3_pool", "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "trainable": false, "strides": [2, 2], "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_pool", 0, 0, {}]]], "name": "block4_conv1", "config": {"bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "name": "block4_conv1", "trainable": false, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dtype": "float32", "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 512, "data_format": "channels_last", "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "name": "block4_conv2", "config": {"bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "name": "block4_conv2", "trainable": false, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dtype": "float32", "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 512, "data_format": "channels_last", "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "name": "block4_conv3", "config": {"bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "name": "block4_conv3", "trainable": false, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dtype": "float32", "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 512, "data_format": "channels_last", "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "name": "block4_conv4", "config": {"bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "name": "block4_conv4", "trainable": true, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dtype": "float32", "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 512, "data_format": "channels_last", "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv4", 0, 0, {}]]], "name": "block4_pool", "config": {"name": "block4_pool", "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["block4_pool", 0, 0, {}]]], "name": "block5_conv1", "config": {"bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "name": "block5_conv1", "trainable": true, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dtype": "float32", "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 512, "data_format": "channels_last", "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "name": "block5_conv2", "config": {"bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "name": "block5_conv2", "trainable": true, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dtype": "float32", "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 512, "data_format": "channels_last", "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "name": "block5_conv3", "config": {"bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "name": "block5_conv3", "trainable": true, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dtype": "float32", "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 512, "data_format": "channels_last", "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "Conv2D", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "name": "block5_conv4", "config": {"bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "name": "block5_conv4", "trainable": true, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "dtype": "float32", "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "filters": 512, "data_format": "channels_last", "padding": "same", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv4", 0, 0, {}]]], "name": "block5_pool", "config": {"name": "block5_pool", "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "dtype": "float32"}}, {"class_name": "GlobalMaxPooling2D", "inbound_nodes": [[["block5_pool", 0, 0, {}]]], "name": "global_max_pooling2d_1", "config": {"trainable": true, "dtype": "float32", "name": "global_max_pooling2d_1", "data_format": "channels_last"}}, {"class_name": "Dense", "inbound_nodes": [[["global_max_pooling2d_1", 0, 0, {}]]], "name": "dense_1", "config": {"activation": "relu", "kernel_regularizer": null, "name": "dense_1", "trainable": true, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "units": 256}}, {"class_name": "Dropout", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dropout_1", "config": {"seed": null, "rate": 0.5, "name": "dropout_1", "trainable": true, "noise_shape": null, "dtype": "float32"}}, {"class_name": "Dense", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "dense_2", "config": {"activation": "sigmoid", "kernel_regularizer": null, "name": "dense_2", "trainable": true, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "use_bias": true, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "units": 4}}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]], "name": "model_1"}, "backend": "tensorflow"}